import Mock from "mockjs";

Mock.mock("/screen/wordcloud", {
  code: 0,
  data:[
    {
        "word": "深圳",
        "count": 8917,
        "user": 7394
    },
    {
        "word": "太原",
        "count": 6995,
        "user": 6488
    },
    {
        "word": "牛肉",
        "count": 8855,
        "user": 5429
    },
    {
        "word": "大连",
        "count": 6253,
        "user": 5059
    },
    {
        "word": "烩饭",
        "count": 5100,
        "user": 4414
    },
    {
        "word": "沈阳",
        "count": 5519,
        "user": 4226
    },
    {
        "word": "长春",
        "count": 9953,
        "user": 3944
    },
    {
        "word": "北京",
        "count": 6246,
        "user": 3822
    },
    {
        "word": "鸡腿",
        "count": 4227,
        "user": 3696
    },
    {
        "word": "哈尔滨",
        "count": 9034,
        "user": 3555
    },
    {
        "word": "送药",
        "count": 6165,
        "user": 3197
    },
    {
        "word": "南宁",
        "count": 5008,
        "user": 3029
    },
    {
        "word": "济南",
        "count": 4519,
        "user": 2998
    },
    {
        "word": "海底捞",
        "count": 8352,
        "user": 2955
    },
    {
        "word": "全家桶",
        "count": 9771,
        "user": 2771
    },
    {
        "word": "炭烤",
        "count": 4914,
        "user": 2678
    },
    {
        "word": "常州",
        "count": 6040,
        "user": 2499
    },
    {
        "word": "冒菜",
        "count": 5082,
        "user": 1901
    },
    {
        "word": "无锡",
        "count": 6655,
        "user": 1876
    },
    {
        "word": "商超",
        "count": 6891,
        "user": 1867
    },
    {
        "word": "跑腿",
        "count": 5539,
        "user": 1861
    },
    {
        "word": "南京",
        "count": 7645,
        "user": 1788
    },
    {
        "word": "面条",
        "count": 5454,
        "user": 1625
    },
    {
        "word": "肯德基",
        "count": 3552,
        "user": 1559
    },
    {
        "word": "麻辣",
        "count": 4058,
        "user": 1381
    },
    {
        "word": "合肥",
        "count": 1539,
        "user": 1261
    },
    {
        "word": "麦当劳",
        "count": 2105,
        "user": 1132
    },
    {
        "word": "成都",
        "count": 3669,
        "user": 1084
    },
    {
        "word": "重庆",
        "count": 3134,
        "user": 953
    },
    {
        "word": "小龙虾",
        "count": 8460,
        "user": 908
    },
    {
        "word": "呼和浩特",
        "count": 1945,
        "user": 888
    },
    {
        "word": "广州",
        "count": 1434,
        "user": 872
    },
    {
        "word": "美食",
        "count": 1096,
        "user": 824
    },
    {
        "word": "苏州",
        "count": 6437,
        "user": 761
    },
    {
        "word": "水果",
        "count": 947,
        "user": 642
    },
    {
        "word": "武汉",
        "count": 713,
        "user": 490
    },
    {
        "word": "麦乐鸡",
        "count": 599,
        "user": 336
    },
    {
        "word": "上海",
        "count": 2065,
        "user": 227
    },
    {
        "word": "拉萨",
        "count": 196,
        "user": 182
    },
    {
        "word": "必胜客",
        "count": 2360,
        "user": 178
    },
    {
        "word": "杭州",
        "count": 4541,
        "user": 158
    },
    {
        "word": "温州",
        "count": 1161,
        "user": 10
    }
]
});

Mock.mock("/screen/mapscatter", {
  code: 0,
  data:{
    "data": [
        {
            "name": "杭州",
            "value": 384
        },
        {
            "name": "北京",
            "value": 279
        },
        {
            "name": "南京",
            "value": 267
        },
        {
            "name": "天津",
            "value": 195
        },
        {
            "name": "济南",
            "value": 192
        },
        {
            "name": "长沙",
            "value": 175
        },
        {
            "name": "武汉",
            "value": 173
        },
        {
            "name": "石家庄",
            "value": 147
        },
        {
            "name": "宜昌",
            "value": 130
        },
        {
            "name": "合肥",
            "value": 129
        },
        {
            "name": "上海",
            "value": 125
        },
        {
            "name": "南通",
            "value": 123
        },
        {
            "name": "青岛",
            "value": 118
        },
        {
            "name": "哈尔滨",
            "value": 114
        },
        {
            "name": "郑州",
            "value": 113
        },
        {
            "name": "南充",
            "value": 104
        },
        {
            "name": "临安",
            "value": 99
        },
        {
            "name": "兰州",
            "value": 99
        },
        {
            "name": "邯郸",
            "value": 98
        },
        {
            "name": "芜湖",
            "value": 97
        },
        {
            "name": "九江",
            "value": 96
        },
        {
            "name": "温州",
            "value": 95
        },
        {
            "name": "德阳",
            "value": 93
        },
        {
            "name": "安阳",
            "value": 90
        },
        {
            "name": "开封",
            "value": 90
        },
        {
            "name": "鞍山",
            "value": 86
        },
        {
            "name": "溧阳",
            "value": 86
        },
        {
            "name": "库尔勒",
            "value": 86
        },
        {
            "name": "淄博",
            "value": 85
        },
        {
            "name": "乌鲁木齐",
            "value": 84
        },
        {
            "name": "枣庄",
            "value": 84
        },
        {
            "name": "衡水",
            "value": 80
        },
        {
            "name": "包头",
            "value": 80
        },
        {
            "name": "绵阳",
            "value": 80
        },
        {
            "name": "徐州",
            "value": 79
        },
        {
            "name": "焦作",
            "value": 75
        },
        {
            "name": "句容",
            "value": 75
        },
        {
            "name": "克拉玛依",
            "value": 72
        },
        {
            "name": "渭南",
            "value": 72
        },
        {
            "name": "马鞍山",
            "value": 72
        },
        {
            "name": "宝鸡",
            "value": 72
        },
        {
            "name": "贵阳",
            "value": 71
        },
        {
            "name": "无锡",
            "value": 71
        },
        {
            "name": "本溪",
            "value": 71
        },
        {
            "name": "滨州",
            "value": 70
        },
        {
            "name": "台州",
            "value": 67
        },
        {
            "name": "重庆",
            "value": 66
        },
        {
            "name": "潍坊",
            "value": 65
        },
        {
            "name": "扬州",
            "value": 64
        },
        {
            "name": "常州",
            "value": 64
        },
        {
            "name": "牡丹江",
            "value": 63
        },
        {
            "name": "遵义",
            "value": 63
        },
        {
            "name": "绍兴",
            "value": 63
        },
        {
            "name": "金坛",
            "value": 62
        },
        {
            "name": "东营",
            "value": 62
        },
        {
            "name": "西安",
            "value": 61
        },
        {
            "name": "北海",
            "value": 60
        },
        {
            "name": "镇江",
            "value": 59
        },
        {
            "name": "桂林",
            "value": 59
        },
        {
            "name": "张家界",
            "value": 59
        },
        {
            "name": "宜兴",
            "value": 59
        },
        {
            "name": "宜宾",
            "value": 58
        },
        {
            "name": "呼和浩特",
            "value": 58
        },
        {
            "name": "成都",
            "value": 58
        },
        {
            "name": "大同",
            "value": 58
        },
        {
            "name": "阳江",
            "value": 57
        },
        {
            "name": "泸州",
            "value": 57
        },
        {
            "name": "西宁",
            "value": 57
        },
        {
            "name": "自贡",
            "value": 56
        },
        {
            "name": "吉林",
            "value": 56
        },
        {
            "name": "聊城",
            "value": 56
        },
        {
            "name": "锦州",
            "value": 54
        },
        {
            "name": "南昌",
            "value": 54
        },
        {
            "name": "柳州",
            "value": 54
        },
        {
            "name": "三亚",
            "value": 54
        },
        {
            "name": "三门峡",
            "value": 53
        },
        {
            "name": "胶州",
            "value": 52
        },
        {
            "name": "银川",
            "value": 52
        },
        {
            "name": "张家港",
            "value": 52
        },
        {
            "name": "嘉兴",
            "value": 51
        },
        {
            "name": "长春",
            "value": 51
        },
        {
            "name": "沈阳",
            "value": 50
        },
        {
            "name": "苏州",
            "value": 50
        },
        {
            "name": "茂名",
            "value": 50
        },
        {
            "name": "石嘴山",
            "value": 49
        },
        {
            "name": "莱芜",
            "value": 48
        },
        {
            "name": "大连",
            "value": 47
        },
        {
            "name": "临汾",
            "value": 47
        },
        {
            "name": "吴江",
            "value": 47
        },
        {
            "name": "肇庆",
            "value": 46
        },
        {
            "name": "江门",
            "value": 45
        },
        {
            "name": "章丘",
            "value": 45
        },
        {
            "name": "铜川",
            "value": 44
        },
        {
            "name": "平度",
            "value": 44
        },
        {
            "name": "佛山",
            "value": 44
        },
        {
            "name": "海口",
            "value": 44
        },
        {
            "name": "宿迁",
            "value": 43
        },
        {
            "name": "咸阳",
            "value": 43
        },
        {
            "name": "株洲",
            "value": 43
        },
        {
            "name": "珠海",
            "value": 42
        },
        {
            "name": "长治",
            "value": 41
        },
        {
            "name": "深圳",
            "value": 41
        },
        {
            "name": "寿光",
            "value": 40
        },
        {
            "name": "盘锦",
            "value": 40
        },
        {
            "name": "德州",
            "value": 40
        },
        {
            "name": "太原",
            "value": 39
        },
        {
            "name": "清远",
            "value": 39
        },
        {
            "name": "中山",
            "value": 39
        },
        {
            "name": "昆明",
            "value": 39
        },
        {
            "name": "韶关",
            "value": 38
        },
        {
            "name": "嘉峪关",
            "value": 38
        },
        {
            "name": "广州",
            "value": 38
        },
        {
            "name": "延安",
            "value": 38
        },
        {
            "name": "南宁",
            "value": 37
        },
        {
            "name": "营口",
            "value": 37
        },
        {
            "name": "惠州",
            "value": 37
        },
        {
            "name": "江阴",
            "value": 37
        },
        {
            "name": "蓬莱",
            "value": 37
        },
        {
            "name": "金华",
            "value": 37
        },
        {
            "name": "常熟",
            "value": 36
        },
        {
            "name": "东莞",
            "value": 36
        },
        {
            "name": "河源",
            "value": 36
        },
        {
            "name": "淮安",
            "value": 36
        },
        {
            "name": "泰州",
            "value": 36
        },
        {
            "name": "秦皇岛",
            "value": 36
        },
        {
            "name": "连云港",
            "value": 35
        },
        {
            "name": "葫芦岛",
            "value": 35
        },
        {
            "name": "揭阳",
            "value": 34
        },
        {
            "name": "荣成",
            "value": 34
        },
        {
            "name": "洛阳",
            "value": 34
        },
        {
            "name": "昆山",
            "value": 33
        },
        {
            "name": "宁波",
            "value": 33
        },
        {
            "name": "湛江",
            "value": 33
        },
        {
            "name": "丽水",
            "value": 33
        },
        {
            "name": "莱州",
            "value": 32
        },
        {
            "name": "湖州",
            "value": 32
        },
        {
            "name": "汕头",
            "value": 32
        },
        {
            "name": "义乌",
            "value": 32
        },
        {
            "name": "抚顺",
            "value": 31
        },
        {
            "name": "玉溪",
            "value": 31
        },
        {
            "name": "张家口",
            "value": 31
        },
        {
            "name": "阳泉",
            "value": 31
        },
        {
            "name": "瓦房店",
            "value": 30
        },
        {
            "name": "即墨",
            "value": 30
        },
        {
            "name": "福州",
            "value": 29
        },
        {
            "name": "唐山",
            "value": 29
        },
        {
            "name": "岳阳",
            "value": 29
        },
        {
            "name": "烟台",
            "value": 28
        },
        {
            "name": "丹东",
            "value": 27
        },
        {
            "name": "太仓",
            "value": 27
        },
        {
            "name": "曲靖",
            "value": 27
        },
        {
            "name": "荆州",
            "value": 27
        },
        {
            "name": "厦门",
            "value": 26
        },
        {
            "name": "汕尾",
            "value": 26
        },
        {
            "name": "潮州",
            "value": 26
        },
        {
            "name": "梅州",
            "value": 25
        },
        {
            "name": "文登",
            "value": 25
        },
        {
            "name": "攀枝花",
            "value": 25
        },
        {
            "name": "威海",
            "value": 25
        },
        {
            "name": "承德",
            "value": 25
        },
        {
            "name": "拉萨",
            "value": 24
        },
        {
            "name": "云浮",
            "value": 24
        },
        {
            "name": "廊坊",
            "value": 23
        },
        {
            "name": "胶南",
            "value": 22
        },
        {
            "name": "常德",
            "value": 22
        },
        {
            "name": "泉州",
            "value": 21
        },
        {
            "name": "莱西",
            "value": 21
        },
        {
            "name": "日照",
            "value": 21
        },
        {
            "name": "诸暨",
            "value": 20
        },
        {
            "name": "济宁",
            "value": 20
        },
        {
            "name": "金昌",
            "value": 19
        },
        {
            "name": "平顶山",
            "value": 19
        },
        {
            "name": "邢台",
            "value": 19
        },
        {
            "name": "菏泽",
            "value": 19
        },
        {
            "name": "乳山",
            "value": 18
        },
        {
            "name": "衢州",
            "value": 17
        },
        {
            "name": "赤峰",
            "value": 16
        },
        {
            "name": "盐城",
            "value": 15
        },
        {
            "name": "齐齐哈尔",
            "value": 14
        },
        {
            "name": "湘潭",
            "value": 14
        },
        {
            "name": "临沂",
            "value": 13
        },
        {
            "name": "保定",
            "value": 13
        },
        {
            "name": "鄂尔多斯",
            "value": 12
        },
        {
            "name": "招远",
            "value": 12
        },
        {
            "name": "舟山",
            "value": 12
        },
        {
            "name": "泰安",
            "value": 12
        },
        {
            "name": "大庆",
            "value": 12
        },
        {
            "name": "沧州",
            "value": 10
        },
        {
            "name": "海门",
            "value": 9
        },
        {
            "name": "富阳",
            "value": 6
        }
    ],
    "geo": {
        "海门": [
            121.15,
            31.89
        ],
        "鄂尔多斯": [
            109.781327,
            39.608266
        ],
        "招远": [
            120.38,
            37.35
        ],
        "舟山": [
            122.207216,
            29.985295
        ],
        "齐齐哈尔": [
            123.97,
            47.33
        ],
        "盐城": [
            120.13,
            33.38
        ],
        "赤峰": [
            118.87,
            42.28
        ],
        "青岛": [
            120.33,
            36.07
        ],
        "乳山": [
            121.52,
            36.89
        ],
        "金昌": [
            102.188043,
            38.520089
        ],
        "泉州": [
            118.58,
            24.93
        ],
        "莱西": [
            120.53,
            36.86
        ],
        "日照": [
            119.46,
            35.42
        ],
        "胶南": [
            119.97,
            35.88
        ],
        "南通": [
            121.05,
            32.08
        ],
        "拉萨": [
            91.11,
            29.97
        ],
        "云浮": [
            112.02,
            22.93
        ],
        "梅州": [
            116.1,
            24.55
        ],
        "文登": [
            122.05,
            37.2
        ],
        "上海": [
            121.48,
            31.22
        ],
        "攀枝花": [
            101.718637,
            26.582347
        ],
        "威海": [
            122.1,
            37.5
        ],
        "承德": [
            117.93,
            40.97
        ],
        "厦门": [
            118.1,
            24.46
        ],
        "汕尾": [
            115.375279,
            22.786211
        ],
        "潮州": [
            116.63,
            23.68
        ],
        "丹东": [
            124.37,
            40.13
        ],
        "太仓": [
            121.1,
            31.45
        ],
        "曲靖": [
            103.79,
            25.51
        ],
        "烟台": [
            121.39,
            37.52
        ],
        "福州": [
            119.3,
            26.08
        ],
        "瓦房店": [
            121.979603,
            39.627114
        ],
        "即墨": [
            120.45,
            36.38
        ],
        "抚顺": [
            123.97,
            41.97
        ],
        "玉溪": [
            102.52,
            24.35
        ],
        "张家口": [
            114.87,
            40.82
        ],
        "阳泉": [
            113.57,
            37.85
        ],
        "莱州": [
            119.942327,
            37.177017
        ],
        "湖州": [
            120.1,
            30.86
        ],
        "汕头": [
            116.69,
            23.39
        ],
        "昆山": [
            120.95,
            31.39
        ],
        "宁波": [
            121.56,
            29.86
        ],
        "湛江": [
            110.359377,
            21.270708
        ],
        "揭阳": [
            116.35,
            23.55
        ],
        "荣成": [
            122.41,
            37.16
        ],
        "连云港": [
            119.16,
            34.59
        ],
        "葫芦岛": [
            120.836932,
            40.711052
        ],
        "常熟": [
            120.74,
            31.64
        ],
        "东莞": [
            113.75,
            23.04
        ],
        "河源": [
            114.68,
            23.73
        ],
        "淮安": [
            119.15,
            33.5
        ],
        "泰州": [
            119.9,
            32.49
        ],
        "南宁": [
            108.33,
            22.84
        ],
        "营口": [
            122.18,
            40.65
        ],
        "惠州": [
            114.4,
            23.09
        ],
        "江阴": [
            120.26,
            31.91
        ],
        "蓬莱": [
            120.75,
            37.8
        ],
        "韶关": [
            113.62,
            24.84
        ],
        "嘉峪关": [
            98.289152,
            39.77313
        ],
        "广州": [
            113.23,
            23.16
        ],
        "延安": [
            109.47,
            36.6
        ],
        "太原": [
            112.53,
            37.87
        ],
        "清远": [
            113.01,
            23.7
        ],
        "中山": [
            113.38,
            22.52
        ],
        "昆明": [
            102.73,
            25.04
        ],
        "寿光": [
            118.73,
            36.86
        ],
        "盘锦": [
            122.070714,
            41.119997
        ],
        "长治": [
            113.08,
            36.18
        ],
        "深圳": [
            114.07,
            22.62
        ],
        "珠海": [
            113.52,
            22.3
        ],
        "宿迁": [
            118.3,
            33.96
        ],
        "咸阳": [
            108.72,
            34.36
        ],
        "铜川": [
            109.11,
            35.09
        ],
        "平度": [
            119.97,
            36.77
        ],
        "佛山": [
            113.11,
            23.05
        ],
        "海口": [
            110.35,
            20.02
        ],
        "江门": [
            113.06,
            22.61
        ],
        "章丘": [
            117.53,
            36.72
        ],
        "肇庆": [
            112.44,
            23.05
        ],
        "大连": [
            121.62,
            38.92
        ],
        "临汾": [
            111.5,
            36.08
        ],
        "吴江": [
            120.63,
            31.16
        ],
        "石嘴山": [
            106.39,
            39.04
        ],
        "沈阳": [
            123.38,
            41.8
        ],
        "苏州": [
            120.62,
            31.32
        ],
        "茂名": [
            110.88,
            21.68
        ],
        "嘉兴": [
            120.76,
            30.77
        ],
        "长春": [
            125.35,
            43.88
        ],
        "胶州": [
            120.03336,
            36.264622
        ],
        "银川": [
            106.27,
            38.47
        ],
        "张家港": [
            120.555821,
            31.875428
        ],
        "三门峡": [
            111.19,
            34.76
        ],
        "锦州": [
            121.15,
            41.13
        ],
        "南昌": [
            115.89,
            28.68
        ],
        "柳州": [
            109.4,
            24.33
        ],
        "三亚": [
            109.511909,
            18.252847
        ],
        "自贡": [
            104.778442,
            29.33903
        ],
        "吉林": [
            126.57,
            43.87
        ],
        "阳江": [
            111.95,
            21.85
        ],
        "泸州": [
            105.39,
            28.91
        ],
        "西宁": [
            101.74,
            36.56
        ],
        "宜宾": [
            104.56,
            29.77
        ],
        "呼和浩特": [
            111.65,
            40.82
        ],
        "成都": [
            104.06,
            30.67
        ],
        "大同": [
            113.3,
            40.12
        ],
        "镇江": [
            119.44,
            32.2
        ],
        "桂林": [
            110.28,
            25.29
        ],
        "张家界": [
            110.479191,
            29.117096
        ],
        "宜兴": [
            119.82,
            31.36
        ],
        "北海": [
            109.12,
            21.49
        ],
        "西安": [
            108.95,
            34.27
        ],
        "金坛": [
            119.56,
            31.74
        ],
        "东营": [
            118.49,
            37.46
        ],
        "牡丹江": [
            129.58,
            44.6
        ],
        "遵义": [
            106.9,
            27.7
        ],
        "绍兴": [
            120.58,
            30.01
        ],
        "扬州": [
            119.42,
            32.39
        ],
        "常州": [
            119.95,
            31.79
        ],
        "潍坊": [
            119.1,
            36.62
        ],
        "重庆": [
            106.54,
            29.59
        ],
        "台州": [
            121.420757,
            28.656386
        ],
        "南京": [
            118.78,
            32.04
        ],
        "滨州": [
            118.03,
            37.36
        ],
        "贵阳": [
            106.71,
            26.57
        ],
        "无锡": [
            120.29,
            31.59
        ],
        "本溪": [
            123.73,
            41.3
        ],
        "克拉玛依": [
            84.77,
            45.59
        ],
        "渭南": [
            109.5,
            34.52
        ],
        "马鞍山": [
            118.48,
            31.56
        ],
        "宝鸡": [
            107.15,
            34.38
        ],
        "焦作": [
            113.21,
            35.24
        ],
        "句容": [
            119.16,
            31.95
        ],
        "北京": [
            116.46,
            39.92
        ],
        "徐州": [
            117.2,
            34.26
        ],
        "衡水": [
            115.72,
            37.72
        ],
        "包头": [
            110,
            40.58
        ],
        "绵阳": [
            104.73,
            31.48
        ],
        "乌鲁木齐": [
            87.68,
            43.77
        ],
        "枣庄": [
            117.57,
            34.86
        ],
        "杭州": [
            120.19,
            30.26
        ],
        "淄博": [
            118.05,
            36.78
        ],
        "鞍山": [
            122.85,
            41.12
        ],
        "溧阳": [
            119.48,
            31.43
        ],
        "库尔勒": [
            86.06,
            41.68
        ],
        "安阳": [
            114.35,
            36.1
        ],
        "开封": [
            114.35,
            34.79
        ],
        "济南": [
            117,
            36.65
        ],
        "德阳": [
            104.37,
            31.13
        ],
        "温州": [
            120.65,
            28.01
        ],
        "九江": [
            115.97,
            29.71
        ],
        "邯郸": [
            114.47,
            36.6
        ],
        "临安": [
            119.72,
            30.23
        ],
        "兰州": [
            103.73,
            36.03
        ],
        "沧州": [
            116.83,
            38.33
        ],
        "临沂": [
            118.35,
            35.05
        ],
        "南充": [
            106.110698,
            30.837793
        ],
        "天津": [
            117.2,
            39.13
        ],
        "富阳": [
            119.95,
            30.07
        ],
        "泰安": [
            117.13,
            36.18
        ],
        "诸暨": [
            120.23,
            29.71
        ],
        "郑州": [
            113.65,
            34.76
        ],
        "哈尔滨": [
            126.63,
            45.75
        ],
        "聊城": [
            115.97,
            36.45
        ],
        "芜湖": [
            118.38,
            31.33
        ],
        "唐山": [
            118.02,
            39.63
        ],
        "平顶山": [
            113.29,
            33.75
        ],
        "邢台": [
            114.48,
            37.05
        ],
        "德州": [
            116.29,
            37.45
        ],
        "济宁": [
            116.59,
            35.38
        ],
        "荆州": [
            112.239741,
            30.335165
        ],
        "宜昌": [
            111.3,
            30.7
        ],
        "义乌": [
            120.06,
            29.32
        ],
        "丽水": [
            119.92,
            28.45
        ],
        "洛阳": [
            112.44,
            34.7
        ],
        "秦皇岛": [
            119.57,
            39.95
        ],
        "株洲": [
            113.16,
            27.83
        ],
        "石家庄": [
            114.48,
            38.03
        ],
        "莱芜": [
            117.67,
            36.19
        ],
        "常德": [
            111.69,
            29.05
        ],
        "保定": [
            115.48,
            38.85
        ],
        "湘潭": [
            112.91,
            27.87
        ],
        "金华": [
            119.64,
            29.12
        ],
        "岳阳": [
            113.09,
            29.37
        ],
        "长沙": [
            113,
            28.21
        ],
        "衢州": [
            118.88,
            28.97
        ],
        "廊坊": [
            116.7,
            39.53
        ],
        "菏泽": [
            115.480656,
            35.23375
        ],
        "合肥": [
            117.27,
            31.86
        ],
        "武汉": [
            114.31,
            30.52
        ],
        "大庆": [
            125.03,
            46.58
        ]
    }
}
});
Mock.mock("/screen/screendata", {
  code: 0,
  data:{
    "userToday": 1732407,
    "userLastDay": 1000000,
    "userLastMonth": 800000,
    "userGrowthLastDay": "73.20",
    "userGrowthLastMonth": "116.50",
    "age": [
        {
            "key": "0-20",
            "value": 303243
        },
        {
            "key": "20-30",
            "value": 503500
        },
        {
            "key": "30-50",
            "value": 722657
        },
        {
            "key": ">50",
            "value": 203007
        }
    ],
    "averageAge": "30.06",
    "totalDevices": 1366486,
    "devices": [
        {
            "key": "Android",
            "value": 522188
        },
        {
            "key": "iOS",
            "value": 472266
        },
        {
            "key": "PC",
            "value": 372032
        }
    ],
    "gender": [
        {
            "key": "male",
            "value": 866346
        },
        {
            "key": "female",
            "value": 866061
        }
    ],
    "rider": {
        "axisX": [
            "1月",
            "2月",
            "3月",
            "4月",
            "5月",
            "6月",
            "7月",
            "8月",
            "9月",
            "10月",
            "11月",
            "12月"
        ],
        "orderData": {
            "legend1": "去年骑手月人均接单",
            "legend2": "今年骑手月人均接单",
            "data1": [
                "330",
                "420",
                "560",
                "450",
                "610",
                "890",
                "720",
                "610",
                "580",
                "750",
                "770",
                "600"
            ],
            "data2": [
                "430",
                "510",
                "660",
                "550",
                "710",
                "990",
                "620",
                "550",
                "760",
                "810",
                "930",
                "720"
            ]
        },
        "rateData": {
            "legend1": "去年月新增骑手",
            "legend2": "今年月新增骑手",
            "data1": [
                "129",
                "223",
                "202",
                "197",
                "300",
                "112",
                "333",
                "249",
                "178",
                "322",
                "401",
                "167"
            ],
            "data2": [
                "179",
                "263",
                "282",
                "297",
                "330",
                "344",
                "222",
                "299",
                "190",
                "455",
                "566",
                "233"
            ]
        }
    },
    "category": {
        "data1": {
            "axisX": [
                "粉面粥店",
                "简餐便当",
                "汉堡披萨",
                "香锅冒菜",
                "小吃炸串",
                "地方菜系",
                "轻食简餐"
            ],
            "data1": [
                45,
                54,
                59,
                7,
                49,
                12,
                29
            ],
            "data2": [
                55,
                46,
                41,
                93,
                51,
                88,
                71
            ]
        },
        "data2": {
            "axisX": [
                "草莓",
                "甘蔗",
                "榴莲",
                "菠萝",
                "香蕉",
                "梨",
                "苹果"
            ],
            "data1": [
                85,
                85,
                6,
                11,
                84,
                52,
                90
            ],
            "data2": [
                15,
                15,
                94,
                89,
                16,
                48,
                10
            ]
        }
    },
    "orderGrowthLastDay": "73.53",
    "orderGrowthLastMonth": "116.92",
    "orderLastMonth": 1600000,
    "orderLastDay": 2000000,
    "orderToday": 3470670,
    "orderTrend": [
        620,
        432,
        220,
        534,
        790,
        430,
        220,
        320,
        532,
        320,
        834,
        690,
        530,
        220,
        620
    ],
    "orderUserTrend": [
        410,
        82,
        200,
        334,
        390,
        330,
        220,
        150,
        82,
        200,
        134,
        290,
        330,
        150
    ],
    "orderUserTrendAxis": [
        "00:00",
        "01:00",
        "02:00",
        "03:00",
        "04:00",
        "05:00",
        "06:00",
        "07:00",
        "08:00",
        "09:00",
        "10:00",
        "11:00",
        "12:00",
        "13:00"
    ],
    "orderFullYearAxis": [
        "1月",
        "2月",
        "3月",
        "4月",
        "5月",
        "6月",
        "7月",
        "8月",
        "9月",
        "10月",
        "11月",
        "12月"
    ],
    "orderFullYear": [
        410,
        82,
        200,
        334,
        390,
        330,
        220,
        150,
        82,
        200,
        134,
        290
    ],
    "userFullYearAxis": [
        "1月",
        "2月",
        "3月",
        "4月",
        "5月",
        "6月",
        "7月",
        "8月",
        "9月",
        "10月",
        "11月",
        "12月"
    ],
    "userFullYear": [
        110,
        120,
        90,
        220,
        175,
        212,
        192,
        95,
        88,
        120,
        250,
        310
    ],
    "orderRank": [
        {
            "no": 1,
            "name": "肯德基",
            "money": "323,234"
        },
        {
            "no": 2,
            "name": "麦当劳",
            "money": "299,132"
        },
        {
            "no": 3,
            "name": "肯德基",
            "money": "283,998"
        },
        {
            "no": 4,
            "name": "海底捞",
            "money": "266,223"
        },
        {
            "no": 5,
            "name": "西贝筱面村",
            "money": "223,445"
        },
        {
            "no": 6,
            "name": "汉堡王",
            "money": "219,663"
        },
        {
            "no": 7,
            "name": "真功夫",
            "money": "200,997"
        }
    ],
    "userRank": [
        {
            "no": 1,
            "name": "麦当劳",
            "money": "211,335"
        },
        {
            "no": 2,
            "name": "肯德基",
            "money": "210,597"
        },
        {
            "no": 3,
            "name": "必胜客",
            "money": "200,998"
        },
        {
            "no": 4,
            "name": "海底捞",
            "money": "199,220"
        },
        {
            "no": 5,
            "name": "西贝筱面村",
            "money": "195,444"
        },
        {
            "no": 6,
            "name": "汉堡王",
            "money": "180,161"
        },
        {
            "no": 7,
            "name": "真功夫",
            "money": "172,995"
        }
    ],
    "salesGrowthLastDay": "88.14",
    "salesGrowthLastMonth": "143.29",
    "salesLastMonth": 23200000,
    "salesLastDay": 30000000,
    "salesToday": 56443125,
    "orderPrice": 15,
    "orderUser": 752564,
    "covertRate": "10.59",
    "returnRate": "5.19",
    "areaSales": [
        {
            "order": "北京 -19%",
            "shop": "北京 -19%",
            "rider": "北京 +10%",
            "newShop": "北京 -7%",
            "avgOrder": "北京 +10%"
        },
        {
            "order": "上海 +14%",
            "shop": "上海 +9%",
            "rider": "上海 +15%",
            "newShop": "上海 -12%",
            "avgOrder": "上海 -17%"
        },
        {
            "order": "广州 +5%",
            "shop": "广州 -21%",
            "rider": "广州 -10%",
            "newShop": "广州 +5%",
            "avgOrder": "广州 -19%"
        },
        {
            "order": "深圳 +21%",
            "shop": "深圳 -17%",
            "rider": "深圳 +10%",
            "newShop": "深圳 +8%",
            "avgOrder": "深圳 +12%"
        },
        {
            "order": "南京 +18%",
            "shop": "南京 -2%",
            "rider": "南京 -5%",
            "newShop": "南京 +22%",
            "avgOrder": "南京 -16%"
        },
        {
            "order": "杭州 -1%",
            "shop": "杭州 -18%",
            "rider": "杭州 +3%",
            "newShop": "杭州 +20%",
            "avgOrder": "杭州 -5%"
        },
        {
            "order": "合肥 -8%",
            "shop": "合肥 -22%",
            "rider": "合肥 +6%",
            "newShop": "合肥 +22%",
            "avgOrder": "合肥 +20%"
        },
        {
            "order": "济南 -4%",
            "shop": "济南 -23%",
            "rider": "济南 +9%",
            "newShop": "济南 -24%",
            "avgOrder": "济南 +9%"
        },
        {
            "order": "太原 +17%",
            "shop": "太原 +8%",
            "rider": "太原 +13%",
            "newShop": "太原 +24%",
            "avgOrder": "太原 -23%"
        },
        {
            "order": "成都 -6%",
            "shop": "成都 +6%",
            "rider": "成都 +9%",
            "newShop": "成都 +22%",
            "avgOrder": "成都 -6%"
        },
        {
            "order": "重庆 +6%",
            "shop": "重庆 +22%",
            "rider": "重庆 -12%",
            "newShop": "重庆 +2%",
            "avgOrder": "重庆 +19%"
        },
        {
            "order": "苏州 -20%",
            "shop": "苏州 -18%",
            "rider": "苏州 -20%",
            "newShop": "苏州 -6%",
            "avgOrder": "苏州 -10%"
        },
        {
            "order": "无锡 +10%",
            "shop": "无锡 -17%",
            "rider": "无锡 +11%",
            "newShop": "无锡 +22%",
            "avgOrder": "无锡 -9%"
        },
        {
            "order": "常州 -17%",
            "shop": "常州 +9%",
            "rider": "常州 -16%",
            "newShop": "常州 -13%",
            "avgOrder": "常州 -24%"
        },
        {
            "order": "温州 -7%",
            "shop": "温州 +19%",
            "rider": "温州 +11%",
            "newShop": "温州 -6%",
            "avgOrder": "温州 -3%"
        },
        {
            "order": "哈尔滨 +15%",
            "shop": "哈尔滨 +14%",
            "rider": "哈尔滨 -17%",
            "newShop": "哈尔滨 -12%",
            "avgOrder": "哈尔滨 +8%"
        },
        {
            "order": "长春 -14%",
            "shop": "长春 -19%",
            "rider": "长春 +13%",
            "newShop": "长春 +4%",
            "avgOrder": "长春 -19%"
        },
        {
            "order": "大连 -7%",
            "shop": "大连 -6%",
            "rider": "大连 +16%",
            "newShop": "大连 +6%",
            "avgOrder": "大连 -9%"
        },
        {
            "order": "沈阳 +10%",
            "shop": "沈阳 -13%",
            "rider": "沈阳 -1%",
            "newShop": "沈阳 -11%",
            "avgOrder": "沈阳 +6%"
        },
        {
            "order": "拉萨 +12%",
            "shop": "拉萨 +13%",
            "rider": "拉萨 +11%",
            "newShop": "拉萨 -4%",
            "avgOrder": "拉萨 +20%"
        },
        {
            "order": "呼和浩特 +6%",
            "shop": "呼和浩特 +20%",
            "rider": "呼和浩特 -11%",
            "newShop": "呼和浩特 +5%",
            "avgOrder": "呼和浩特 +10%"
        },
        {
            "order": "武汉 +17%",
            "shop": "武汉 +10%",
            "rider": "武汉 +4%",
            "newShop": "武汉 -3%",
            "avgOrder": "武汉 -7%"
        },
        {
            "order": "南宁 +17%",
            "shop": "南宁 +22%",
            "rider": "南宁 -18%",
            "newShop": "南宁 -18%",
            "avgOrder": "南宁 -18%"
        }
    ],
    "areaTop": [
        {
            "city": "北京",
            "rate": "+6%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 273,
                    "sales": 3128
                },
                {
                    "shop": "肯德基",
                    "order": 47,
                    "sales": 868
                },
                {
                    "shop": "麦当劳",
                    "order": 232,
                    "sales": 3046
                },
                {
                    "shop": "海底捞",
                    "order": 578,
                    "sales": 8935
                }
            ]
        },
        {
            "city": "上海",
            "rate": "+18%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 148,
                    "sales": 2322
                },
                {
                    "shop": "肯德基",
                    "order": 908,
                    "sales": 14972
                },
                {
                    "shop": "麦当劳",
                    "order": 96,
                    "sales": 1493
                },
                {
                    "shop": "海底捞",
                    "order": 64,
                    "sales": 992
                }
            ]
        },
        {
            "city": "广州",
            "rate": "+17%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 306,
                    "sales": 3717
                },
                {
                    "shop": "肯德基",
                    "order": 851,
                    "sales": 14815
                },
                {
                    "shop": "麦当劳",
                    "order": 864,
                    "sales": 14748
                },
                {
                    "shop": "海底捞",
                    "order": 494,
                    "sales": 6367
                }
            ]
        },
        {
            "city": "深圳",
            "rate": "-9%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 548,
                    "sales": 6066
                },
                {
                    "shop": "肯德基",
                    "order": 638,
                    "sales": 8096
                },
                {
                    "shop": "麦当劳",
                    "order": 934,
                    "sales": 9872
                },
                {
                    "shop": "海底捞",
                    "order": 858,
                    "sales": 13556
                }
            ]
        },
        {
            "city": "南京",
            "rate": "+22%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 518,
                    "sales": 8666
                },
                {
                    "shop": "肯德基",
                    "order": 762,
                    "sales": 14638
                },
                {
                    "shop": "麦当劳",
                    "order": 100,
                    "sales": 1589
                },
                {
                    "shop": "海底捞",
                    "order": 257,
                    "sales": 4422
                }
            ]
        },
        {
            "city": "杭州",
            "rate": "-21%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 955,
                    "sales": 9788
                },
                {
                    "shop": "肯德基",
                    "order": 189,
                    "sales": 3430
                },
                {
                    "shop": "麦当劳",
                    "order": 551,
                    "sales": 9725
                },
                {
                    "shop": "海底捞",
                    "order": 382,
                    "sales": 7219
                }
            ]
        },
        {
            "city": "合肥",
            "rate": "+9%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 892,
                    "sales": 15797
                },
                {
                    "shop": "肯德基",
                    "order": 607,
                    "sales": 7745
                },
                {
                    "shop": "麦当劳",
                    "order": 686,
                    "sales": 7381
                },
                {
                    "shop": "海底捞",
                    "order": 268,
                    "sales": 3462
                }
            ]
        },
        {
            "city": "济南",
            "rate": "+13%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 436,
                    "sales": 6810
                },
                {
                    "shop": "肯德基",
                    "order": 289,
                    "sales": 3219
                },
                {
                    "shop": "麦当劳",
                    "order": 735,
                    "sales": 12502
                },
                {
                    "shop": "海底捞",
                    "order": 369,
                    "sales": 4435
                }
            ]
        },
        {
            "city": "太原",
            "rate": "+7%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 661,
                    "sales": 11772
                },
                {
                    "shop": "肯德基",
                    "order": 102,
                    "sales": 1460
                },
                {
                    "shop": "麦当劳",
                    "order": 105,
                    "sales": 1247
                },
                {
                    "shop": "海底捞",
                    "order": 10,
                    "sales": 192
                }
            ]
        },
        {
            "city": "成都",
            "rate": "+9%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 370,
                    "sales": 5542
                },
                {
                    "shop": "肯德基",
                    "order": 563,
                    "sales": 6451
                },
                {
                    "shop": "麦当劳",
                    "order": 43,
                    "sales": 654
                },
                {
                    "shop": "海底捞",
                    "order": 764,
                    "sales": 13087
                }
            ]
        },
        {
            "city": "重庆",
            "rate": "+20%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 888,
                    "sales": 9004
                },
                {
                    "shop": "肯德基",
                    "order": 573,
                    "sales": 7449
                },
                {
                    "shop": "麦当劳",
                    "order": 632,
                    "sales": 12147
                },
                {
                    "shop": "海底捞",
                    "order": 794,
                    "sales": 10798
                }
            ]
        },
        {
            "city": "苏州",
            "rate": "-15%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 99,
                    "sales": 1831
                },
                {
                    "shop": "肯德基",
                    "order": 460,
                    "sales": 4802
                },
                {
                    "shop": "麦当劳",
                    "order": 836,
                    "sales": 16661
                },
                {
                    "shop": "海底捞",
                    "order": 271,
                    "sales": 4737
                }
            ]
        },
        {
            "city": "无锡",
            "rate": "-16%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 296,
                    "sales": 3942
                },
                {
                    "shop": "肯德基",
                    "order": 198,
                    "sales": 3906
                },
                {
                    "shop": "麦当劳",
                    "order": 357,
                    "sales": 4426
                },
                {
                    "shop": "海底捞",
                    "order": 187,
                    "sales": 3717
                }
            ]
        },
        {
            "city": "常州",
            "rate": "-14%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 383,
                    "sales": 6832
                },
                {
                    "shop": "肯德基",
                    "order": 247,
                    "sales": 3586
                },
                {
                    "shop": "麦当劳",
                    "order": 677,
                    "sales": 7264
                },
                {
                    "shop": "海底捞",
                    "order": 109,
                    "sales": 1343
                }
            ]
        },
        {
            "city": "温州",
            "rate": "+15%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 678,
                    "sales": 8868
                },
                {
                    "shop": "肯德基",
                    "order": 977,
                    "sales": 17556
                },
                {
                    "shop": "麦当劳",
                    "order": 538,
                    "sales": 5794
                },
                {
                    "shop": "海底捞",
                    "order": 747,
                    "sales": 11444
                }
            ]
        },
        {
            "city": "哈尔滨",
            "rate": "-23%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 441,
                    "sales": 5384
                },
                {
                    "shop": "肯德基",
                    "order": 187,
                    "sales": 3070
                },
                {
                    "shop": "麦当劳",
                    "order": 559,
                    "sales": 11057
                },
                {
                    "shop": "海底捞",
                    "order": 144,
                    "sales": 1657
                }
            ]
        },
        {
            "city": "长春",
            "rate": "+20%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 875,
                    "sales": 10360
                },
                {
                    "shop": "肯德基",
                    "order": 296,
                    "sales": 3756
                },
                {
                    "shop": "麦当劳",
                    "order": 754,
                    "sales": 13315
                },
                {
                    "shop": "海底捞",
                    "order": 59,
                    "sales": 1110
                }
            ]
        },
        {
            "city": "大连",
            "rate": "-18%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 683,
                    "sales": 8988
                },
                {
                    "shop": "肯德基",
                    "order": 726,
                    "sales": 9271
                },
                {
                    "shop": "麦当劳",
                    "order": 251,
                    "sales": 3383
                },
                {
                    "shop": "海底捞",
                    "order": 399,
                    "sales": 4524
                }
            ]
        },
        {
            "city": "沈阳",
            "rate": "-19%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 171,
                    "sales": 3131
                },
                {
                    "shop": "肯德基",
                    "order": 857,
                    "sales": 10241
                },
                {
                    "shop": "麦当劳",
                    "order": 959,
                    "sales": 12601
                },
                {
                    "shop": "海底捞",
                    "order": 24,
                    "sales": 357
                }
            ]
        },
        {
            "city": "拉萨",
            "rate": "+15%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 56,
                    "sales": 598
                },
                {
                    "shop": "肯德基",
                    "order": 856,
                    "sales": 10597
                },
                {
                    "shop": "麦当劳",
                    "order": 185,
                    "sales": 2584
                },
                {
                    "shop": "海底捞",
                    "order": 594,
                    "sales": 9705
                }
            ]
        },
        {
            "city": "呼和浩特",
            "rate": "+18%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 709,
                    "sales": 10344
                },
                {
                    "shop": "肯德基",
                    "order": 181,
                    "sales": 3125
                },
                {
                    "shop": "麦当劳",
                    "order": 869,
                    "sales": 15859
                },
                {
                    "shop": "海底捞",
                    "order": 534,
                    "sales": 7321
                }
            ]
        },
        {
            "city": "武汉",
            "rate": "+23%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 789,
                    "sales": 8734
                },
                {
                    "shop": "肯德基",
                    "order": 356,
                    "sales": 6707
                },
                {
                    "shop": "麦当劳",
                    "order": 145,
                    "sales": 1590
                },
                {
                    "shop": "海底捞",
                    "order": 619,
                    "sales": 6350
                }
            ]
        },
        {
            "city": "南宁",
            "rate": "-17%",
            "shop": [
                {
                    "shop": "必胜客",
                    "order": 516,
                    "sales": 6919
                },
                {
                    "shop": "肯德基",
                    "order": 811,
                    "sales": 10210
                },
                {
                    "shop": "麦当劳",
                    "order": 208,
                    "sales": 4078
                },
                {
                    "shop": "海底捞",
                    "order": 257,
                    "sales": 4854
                }
            ]
        }
    ],
    "realTimeOrder": 189,
    "growthLastDay": "73.24",
    "growthLastMonth": "116.55"
}
});
